@Vipin654 where did you learn that `writer` role is not supported for atracker service anymore?
I tried by using `writer` role and provisioned successfully

```
module.access_management.module.access_groups["access-management-andrej-admin-obs"].ibm_iam_access_group_policy.policy["atracker"] will be created
  + resource "ibm_iam_access_group_policy" "policy" {
      + access_group_id    = (known after apply)
      + account_management = false
      + id                 = (known after apply)
      + roles              = [
          + "Administrator",
          + "Writer",
        ]
      + transaction_id     = (known after apply)
      + version            = (known after apply)

      + resources {
          + service = "atracker"
        }
    } 
```
```
module.access_management.module.access_groups["access-management-andrej-obsrv-obs"].ibm_iam_access_group_policy.policy["atracker"]: Creation complete after 8s 
```